Revit 2024 API
ViewDisplayModel.EnableSilhouettes Property
 True to show silhouettes edges. False to disable showing them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool EnableSilhouettes { get; set; }
Visual Basic
Public Property EnableSilhouettes As Boolean
	Get
	Set
Visual C++
public:
property bool EnableSilhouettes {
	bool get ();
	void set (bool value);
}
See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace